# coding=utf-8


STATUSES = {
    -3: u'Сообщение не найдено',
    -1: u'Ожидает отправки',
    0: u'Передано оператору',
    1: u'Доставлено',
    3: u'Просрочено',
    20: u'Невозможно доставить',
    22: u'Неверный номер',
    23: u'Запрещено',
    24: u'Недостаточно средств',
    25: u'Недоступный номер',
}

ERRORS = {
    0: u'Нет ошибки',
    1: u'Абонент не существует',
    6: u'Абонент не в сети',
    11: u'Нет услуги SMS',
    13: u'Абонент заблокирован',
    21: u'Нет поддержки SMS',
    245: u'Статус не получен',
    246: u'Ограничение по времени',
    247: u'Превышен лимит сообщений',
    248: u'Нет маршрута',
    249: u'Неверный формат номера',
    250: u'Номер запрещен настройками',
    251: u'Превышен лимит на один номер',
    252: u'Номер запрещен',
    253: u'Запрещено спам-фильтром',
    254: u'Запрещенный sender id',
    255: u'Отклонено оператором',
}
